#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьКоэффициентАктивности(ТипАктивности) Экспорт
	
	Если ТипАктивности = СидячийОбразЖизни Тогда
		Возврат 1.2;
	ИначеЕсли ТипАктивности = СлабаяАктивность Тогда
		Возврат 1.375;
	ИначеЕсли ТипАктивности = СредняяАктивность Тогда
		Возврат 1.55;
	ИначеЕсли ТипАктивности = ВысокаяАктивность Тогда
		Возврат 1.7;
	ИначеЕсли ТипАктивности = ЭкстремальнаяАктивность Тогда
		Возврат 1.9;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип активности.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли