#Область ПрограммныйИнтерфейс

Функция ПолучитьКоличествоКалорий(Объект) Экспорт
	
	Попытка
		МассаТела = РегистрыСведений.РезультатыВзвешивания.ПолучитьВес(Объект.Ссылка);
	Исключение
		СообщениеОбОшибке = НСтр("ru = 'Не удалось получить массу тела.'");
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат 0;
		
	КонецПопытки;
	Возраст = Справочники.ФизическиеЛица.ПолучитьВозраст(Объект.Ссылка);
	КоэффициентАктивности = Перечисления.ТипыАктивности.ПолучитьКоэффициентАктивности(Объект.ТипАктивности);
	
	Если Объект.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		ПоправкаНаПол = 5;
	Иначе
		ПоправкаНаПол = 0;
	КонецЕсли;
	
	Возврат (МассаТела * 10 + Объект.Рост * 100 * 6.25 - Возраст * 5 + ПоправкаНаПол) * КоэффициентАктивности;
		
КонецФункции

Функция ПолучитьКоличествоБЖУ(КоличествоКалорий) Экспорт

	Результат = Новый Структура("Белки, Жиры, Углеводы");
	Результат.Белки = КоличествоКалорий * 0.3 / 4;
	Результат.Жиры = КоличествоКалорий * 0.3 / 9;
	Результат.Углеводы = КоличествоКалорий * 0.4 / 4;

	Возврат Результат;
	
КонецФункции

#КонецОбласти