#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.Продукты.ФормаВыбора" Тогда
		Для Каждого Элемент Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Продукты.Добавить();
			НоваяСтрока.Продукт = Элемент;
		КонецЦикла;
		СвернутьСтрокиНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Продукты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Объект.Продукты.Удалить(Элементы.Продукты.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СвернутьСтрокиНаСервере()
	
	ОбъектСправочник = РеквизитФормыВЗначение("Объект");
	ОбъектСправочник.СвернутьСписокПродуктов();
	ЗначениеВРеквизитФормы(ОбъектСправочник, "Объект");
	
КонецПроцедуры


#КонецОбласти
