#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СвернутьСписокПродуктов() Экспорт
	
	СписокПродуктов = Продукты.Выгрузить();
	СписокПродуктов.Свернуть("Продукт");
	СписокПродуктов.Сортировать("Продукт");
	Продукты.Загрузить(СписокПродуктов);	
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СвернутьСписокПродуктов();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
