#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВес(ФизическоеЛицо, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	РезультатыВзвешиванияСрезПоследних.Вес
	|ИЗ
	|	РегистрСведений.РезультатыВзвешивания.СрезПоследних(&ДатаВзвешивания, ФизическоеЛицо = &ФизическоеЛицо) КАК
	|		РезультатыВзвешиванияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаВзвешивания", ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Для этого физического лица не результатов взвешивания.'");
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;
	
КонецФункции

Функция ДобавитьРезультатИзмерения(ФизическоеЛицо, Вес) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.ФизическоеЛицо = ФизическоеЛицо;
	МенеджерЗаписи.Вес = Вес;
	МенеджерЗаписи.Записать(Истина);
	
КонецФункции

#КонецОбласти

#КонецЕсли